<?php

use yii\db\Migration;

/**
 * Class m200225_170915_insert_area_table
 */
class m200225_170915_insert_area_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert('{{%area}}', [
            'id',
            'name',
            'genitive',
            'nameEnglish',
            'beforeName',
            'afterName',
        ], [
            [1,'Алтайский','Алтайском крае','altayj_kr','','край'],[2,'Амурская','Амурской области','amur','','область'],[3,'Архангельская','Архангельской области','arhangelsk','','область'],[4,'Астраханская','Астраханской области','astrahan','','область'],[5,'Белгородская','Белгородской области','belgorod','','область'],[6,'Брянская','Брянской области','bryansk','','область'],[7,'Владимирская','Владимирской области','vladimir','','область'],[8,'Волгоградская','Волгоградской области','volgograd','','область'],[9,'Вологодская','Вологодской области','vologda','','область'],[10,'Воронежская','Воронежской области','voronej','','область'],[11,'Москва','Городе Москве','moskva','Город',''],[12,'Санкт-Петербург','Городе Санкт-Петербурге','sankt-peterburg','Город',''],[13,'Еврейская','Еврейской автономной области','evreyjsaya','','автономная область'],[14,'Забайкальский','Забайкальский крае','zabayjkal','','край'],[15,'Ивановская','Ивановской области','ivanovo','','область'],[16,'Иркутская','Иркутской области','irkutsk','','область'],[17,'Кабардино-Балкарская','Кабардино-Балкарской Республике','kabardin','','Республика'],[18,'Калининградская','Калининградской области','kaliningrad','','область'],[19,'Калужская','Калужской области','kaluga','','область'],[20,'Камчатский','Камчатском крае','kamchatka','','край'],[21,'Карачаево-Черкесская','Карачаево-Черкесской Республике','karachaev','','Республика'],[22,'Кемеровская','Кемеровской области','kemerovo','','область'],[23,'Кировская','Кировской области','kirov','','область'],[24,'Костромская','Костромской области','kostroma','','область'],[25,'Краснодарский','Краснодарском крае','krasnodar','','край'],[26,'Красноярский','Красноярском крае','krasnoyarsk','','край'],[27,'Алтай','Республике Алтай','altayj','Республика',''],[28,'Курганская','Курганской области','kurgan','','область'],[29,'Курская','Курской области','kursk','','область'],[30,'Ленинградская','Ленинградской области','leningrad','','область'],[31,'Липецкая','Липецкой области','lipeck','','область'],[32,'Магаданская','Магаданской области','magadan','','область'],[33,'Московская','Московской области','moskovskaya','','область'],[34,'Мурманская','Мурманской области','murmansk','','область'],[35,'Ненецкий','Ненецком автономном округе','neneck','','автономный округ'],[36,'Нижегородская','Нижегородской области','nijegorod','','область'],[37,'Новгородская','Новгородской области','novgorod','','область'],[38,'Новосибирская','Новосибирской области','novosibirsk','','область'],[39,'Омская','Омской области','omsk','','область'],[40,'Оренбургская','Оренбургской области','orenburg','','область'],[41,'Орловская','Орловской области','orel','','область'],[42,'Пензенская','Пензенской области','penza','','область'],[43,'Пермский','Пермском крае','perm','','край'],[44,'Приморский','Приморском крае','primorsk','','край'],[45,'Псковская','Псковской области','pskov','','область'],[46,'Адыгея','Республике Адыгея','adygeya','Республика',''],[48,'Башкортостан','Республика Башкортостан','bashkor','Республика',''],[49,'Бурятия','Республике Бурятия','buryatiya','Республика',''],[50,'Дагестан','Республике Дагестан','dagestan','Республика',''],[51,'Ингушетия','Республике Ингушетия','ingushetiya','Республика',''],[52,'Калмыкия','Республике Калмыкия','kalmykiya','Республика',''],[53,'Карелия','Республике Карелия','kareliya','Республика',''],[54,'Коми','Республике Коми','komi','Республика',''],[55,'Крым','Республике Крым','krym','Республика',''],[56,'Марий Эл','Республике Марий Эл','mari','Республика',''],[57,'Мордовия','Республике Мордовия','mordoviya','Республика',''],[58,'Саха [Якутия]','Республике Саха [Якутия]','saha','Республика',''],[59,'Северная Осетия-Алания','Республике Северная Осетия-Алания','alaniya','Республика',''],[60,'Татарстан','Республике Татарстан','tatarstan','Республика',''],[61,'Тыва','Республике Тыва','tyjva','Республика',''],[62,'Хакасия','Республике Хакасия','hakasiya','Республика',''],[63,'Ростовская','Ростовской области','rostov','','область'],[64,'Рязанская','Рязанской области','ryazan','','область'],[65,'Самарская','Самарской области','samara','','область'],[66,'Саратовская','Саратовской области','saratov','','область'],[67,'Сахалинская','Сахалинской области','sahalin','','область'],[68,'Свердловская','Свердловской области','sverdlovsk','','область'],[69,'Смоленская','Смоленской области','smolensk','','область'],[70,'Ставропольский','Ставропольском крае','snavrapol','','край'],[71,'Тамбовская','Тамбовской области','tambov','','область'],[72,'Тверская','Тверской области','tver','','область'],[73,'Томская','Томской области','tomsk','','область'],[74,'Тульская','Тульской области','tula','','область'],[75,'Тюменская','Тюменской области','tyumen','','область'],[76,'Удмуртская','Удмуртской Республике','udmurtiya','','Республика'],[77,'Ульяновская','Ульяновской области','ulyanovsk','','область'],[78,'Хабаровский','Хабаровском крае','habarovsk','','край'],[79,'Ханты-Мансийский','Ханты-Мансийский Автономном округе - Югра','yugra','','Автономный округ - Югра'],[80,'Челябинская','Челябинской области','chelyabisk','','область'],[81,'Чеченская','Чеченской Республике','chechnya','','Республика'],[82,'Чувашия','Чувашской Республике - Чувашия','chuvashiya','Чувашская Республика - ',''],[83,'Чукотский','Чукотском автономном округе','chukotka','','автономный округ'],[84,'Ямало-Ненецкий','Ямало-Ненецком автономном округе','yamal','','автономный округ'],[85,'Ярославская','Ярославской области','yaroslavl','','область'],[86,'Севастополь','Городе Севастополе','sevastopol','Город',''],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->truncateTable('{{%area}}');
    }
}
